apps/server/perf/load-test.yml
# Artillery load test for Phase 15 Day 2 validation
# Usage:
#   LOAD_TEST_TARGET=http://localhost:3333 \
#   LOAD_TEST_COLLECTION_ID=<uuid> \
#   artillery run apps/server/perf/load-test.yml

config:
  target: "{{ $processEnvironment.LOAD_TEST_TARGET || 'http://localhost:3333' }}"
  phases:
    - duration: 120
      arrivalRate: 10
      name: Warm up
    - duration: 600
      arrivalRate: 100
      name: Sustained 100 rps
  defaults:
    headers:
      content-type: application/json
  variables:
    queries:
      - authentication flow
      - caching strategy
      - connection pooling
      - redis ttl config
      - vector index tuning
      - flutter state management
      - postgres migrations
      - supabase auth guards
    tech_filters:
      - []
      - ['postgres']
      - ['supabase']
      - ['redis']
  processor: "./load-test-processor.mjs"

scenarios:
  - name: Hybrid search with rerank
    weight: 6
    flow:
      - function: prepareSearch
      - post:
          url: "/api/search"
          json:
            query: "{{ current_query }}"
            collection_id: "{{ $processEnvironment.LOAD_TEST_COLLECTION_ID }}"
            search_mode: "hybrid"
            rerank: true
            rerank_provider: "cohere"
            top_k: 20
            tech_stack: "{{ current_stack }}"
  - name: Vector only search
    weight: 4
    flow:
      - function: prepareSearch
      - post:
          url: "/api/search"
          json:
            query: "{{ current_query }}"
            collection_id: "{{ $processEnvironment.LOAD_TEST_COLLECTION_ID }}"
            search_mode: "vector"
            top_k: 15
            tech_stack: "{{ current_stack }}"